gxlabs/now-playing-device/firmware/esp-idf/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash / partitions
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Route ALL console output to UART0 so USB serial is free for data protocol
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y

# LVGL QR code
CONFIG_LV_USE_QRCODE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
